# TrueLoadPhaseB Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElectricalSystem..::..TrueLoadPhaseB Property
ElectricalSystem Class See Also
---
The TrueLoadPhaseB value of the Electrical System.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public double TrueLoadPhaseB { get; }
```

Visual Basic
---
```text
Public ReadOnly Property TrueLoadPhaseB As Double
	Get
```

Visual C++
---
```text
public:
property double TrueLoadPhaseB {
	double get ();
}
```

# Remarks
This property is used to retrieve the TrueLoadPhaseB value of the Electrical System.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | This property only available when System Type is Power! |

# See Also
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace